<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\University;

class UniversitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $universities = [
            ['name' => 'جامعة الملك سعود', 'city' => 'الرياض'],
            ['name' => 'جامعة الملك عبدالعزيز', 'city' => 'جدة'],
            ['name' => 'جامعة الملك فهد للبترول والمعادن', 'city' => 'الظهران'],
            ['name' => 'جامعة الإمام محمد بن سعود الإسلامية', 'city' => 'الرياض'],
            ['name' => 'جامعة الملك فيصل', 'city' => 'الأحساء'],
            ['name' => 'جامعة أم القرى', 'city' => 'مكة المكرمة'],
            ['name' => 'الجامعة الإسلامية', 'city' => 'المدينة المنورة'],
            ['name' => 'جامعة الملك خالد', 'city' => 'أبها'],
            ['name' => 'جامعة القصيم', 'city' => 'بريدة'],
            ['name' => 'جامعة طيبة', 'city' => 'المدينة المنورة'],
            ['name' => 'جامعة جازان', 'city' => 'جازان'],
            ['name' => 'جامعة الحدود الشمالية', 'city' => 'عرعر'],
            ['name' => 'جامعة تبوك', 'city' => 'تبوك'],
            ['name' => 'جامعة الطائف', 'city' => 'الطائف'],
            ['name' => 'جامعة الباحة', 'city' => 'الباحة'],
            ['name' => 'جامعة نجران', 'city' => 'نجران'],
            ['name' => 'جامعة الجوف', 'city' => 'سكاكا'],
            ['name' => 'جامعة حائل', 'city' => 'حائل'],
            ['name' => 'جامعة الأمير سطام بن عبدالعزيز', 'city' => 'الخرج'],
            ['name' => 'جامعة المجمعة', 'city' => 'المجمعة'],
            ['name' => 'جامعة الأميرة نورة بنت عبدالرحمن', 'city' => 'الرياض'],
            ['name' => 'جامعة الدمام', 'city' => 'الدمام'],
            ['name' => 'جامعة شقراء', 'city' => 'شقراء'],
            ['name' => 'جامعة الملك سعود بن عبدالعزيز للعلوم الصحية', 'city' => 'الرياض'],
            ['name' => 'الجامعة السعودية الإلكترونية', 'city' => 'الرياض'],
            ['name' => 'جامعة الأعمال والتكنولوجيا', 'city' => 'جدة'],
            ['name' => 'جامعة الفيصل', 'city' => 'الرياض'],
            ['name' => 'جامعة الأمير محمد بن فهد', 'city' => 'الخبر'],
            ['name' => 'جامعة دار العلوم', 'city' => 'الرياض'],
            ['name' => 'جامعة الملك عبدالله للعلوم والتقنية', 'city' => 'ثول'],
        ];

        foreach ($universities as $university) {
            University::create($university);
        }
    }
}

